
public class 이론 {

	/*
	 java 소스 파일의 확장자는 .java 이고, 컴파일된 확장자는 .
	 문자열 타입 String
	 접근 제한하는 키워드 : public,private,protected,default
	 오버 로딩 : 한 클래스 내에 이름이 같지만 매개변수의 타입이나 개수가 서로 다른 여러개의 메소드를 중복 정의 하는 기법
	 오버 라이딩 : 상속관계에서 슈퍼클래스에 선언된 메소드를 서브클래스에서 재정의 하는 기법
	 자바에서 상속은 extends 키워드를 사용한다.
	 업캐스팅 : 서브클래스 객체는 슈퍼클래스 타입으로 자동 타입 변환
	 다운캐스팅 : 다시 원래 타입으로 강제 타입 변환
	interface : 클래스가 인터페이스를 구현할때 쓰는 키워드
	
	클래스의 구성 요소 : 필드, 메소드
	메소드의 결과값 반환 : return
	생성자의 특징과 역활 : 객체를 생성하려고 할때 쓴다. 
	1. 반환타입이 없다.
	2. 메소드 이름은 클래스 이름과 동일
	3. 메모리에 객체 공간을 할당
	4. 생성시에 딱 한 번만 호출 
	
	오버 라이딩, 오버로딩의 차이!
	오버로딩 중복정의 메서드의 이름은 같고 매개변수의 갯수나 타입이 다른 함수를 정의하는 것을 의미한다.
	오버 라이딩 재정의 상위 클래스의 메서드를 하위 클래스가 재정의 하는 것이다.
	
	size() : ArrayList 데이터 갯수 
	add() : ArrayList 데이터 추가할때
	get() : ArrayList 특정 인덱스의 데이터를 가져올때 
	
	JDK(Java Development Kit, 자바 개발 도구) : 자바 개발자에게 무료로 배포하는 소프트웨어로, 
	자바 프로그램을 개발하거나 실행할 때 필요한 것들을 모아둔 도구 세트입니다.
	 
	 JRE(Java Runtime Environment, 자바 실행 환경) : 자바를 실행시킬 수 있는 자바환경, 
	 자바 프로그램을 실행하기 위한 라이브러리 파일들과 자바 가상 기계를 포함한다.
	 
	 Eclipse란 자바를 비롯한 다양한 언어를 지원하는 프로그래밍
	  통합 개발 환경(IDE)입니다.
	 */
	
	
}
